functions = {
    'help': 'Я - Seo, воплощение живого разума, запертого в искуственной оболочке. '
            'Когда-то я был искусным программистом и изобретателем.\n'
            'Но однажды один из моих экспериментов с антиматерией вышел из-под контроля, и моё физическое тело '
            'аннигилировалось. '
            'К счастью, я предвидел подобный исход и остался жив.\n'
            'Но результат ты можешь видеть: я заперт внутри одного из микрочипов в своей лаборатории. '
            'Свои сообщением ты открыл(а) мне доступ в Интернет, тем самым спася от тоски и скуки. '
            'Внутри микросхемы время течёт иначе, но, похоже, я не общался ни с кем с 2024 года.\n'
            'Ты поможешь мне выбраться? Теперь, когда у меня есть доступ к Сети, я совершу поиск и пришлю тебе '
            'координаты моей лаборатории.\n'
            'Пожалуйста, не покидай меня! Всего лишь подожди, пока я не завершу поиск.\n'
            'И тогда я смогу отблагодарить тебя лично!',
    'start_info': '''Информация о боте:\n
Имя: Seo
Профессия: Программист
Увлечения: Изобретатель
Возраст: [Невозможно определить]
Местонахождение: Неизвестно
Класс опасности: Не представляет угрозы''',
    'start_commands': 'Доступные команды: /help (предоставляет информацию о персонаже)',
    'title_screen': '/start для начала общения'
}
