survey = [
    {
        "question": "Что вам больше всего нравится делать на улице?",
        "answers": {
            "Кататься на лыжах": {"зима": 5, "весна": 1, "лето": 0, "осень": 0},
            "Гулять в парке": {"зима": 1, "весна": 2, "лето": 3, "осень": 4},
            "Загорать на пляже": {"зима": 0, "весна": 2, "лето": 5, "осень": 3},
            "Гулять под дождем": {"зима": 0, "весна": 1, "лето": 2, "осень": 4}
        }
    },
    {
        "question": "Какие природные явления вам нравятся больше всего?",
        "answers": {
            "Снегопады": {"зима": 5, "весна": 1, "лето": 0, "осень": 0},
            "Расцветающая природа": {"зима": 1, "весна": 5, "лето": 3, "осень": 0},
            "Теплый солнечный день": {"зима": 0, "весна": 2, "лето": 5, "осень": 3},
            "Падающие листья": {"зима": 0, "весна": 0, "лето": 2, "осень": 5}
        }
    },
    {
        "question": "Какой вид отдыха предпочитаете?",
        "answers": {
            "Горнолыжный курорт": {"зима": 5, "весна": 1, "лето": 0, "осень": 0},
            "Прогулки в парке": {"зима": 1, "весна": 3, "лето": 4, "осень": 2},
            "Отпуск на море": {"зима": 0, "весна": 2, "лето": 5, "осень": 3},
            "Прогулка по лесу": {"зима": 0, "весна": 0, "лето": 2, "осень": 5}
        }
    },
    {
        "question": "Какую одежду предпочитаете?",
        "answers": {
            "Тёплую и уютную": {"зима": 5, "весна": 1, "лето": 0, "осень": 0},
            "Легкую и яркую": {"зима": 0, "весна": 3, "лето": 5, "осень": 2},
            "Простую и удобную": {"зима": 0, "весна": 2, "лето": 4, "осень": 3}
        }
    }
]

user_data = {}

total_score = {'зима': 0, 'весна': 0, 'лето': 0, 'осень': 0}